---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalService.DisparityResponse.ApplyDefaults
enum: Autodesk.Revit.DB.ExternalService.DisparityResponse
source: html/29ab805b-5976-912d-3166-ef04d78d612f.htm
---
# Autodesk.Revit.DB.ExternalService.DisparityResponse.ApplyDefaults

Revit is to apply the default algorithm which is to activate
 just the servers that are remaining available. It could also
 mean that no server will be set at all if the servers previously
 used in the document are not currently registered. If such a
 situation happens for a mandatory service, then the service's
 default server will be set as the new (and only) active server.